using System;

namespace _02_附加题
{
    class Program
    {
        static void Main(string[] args)
        {
            /*步骤:
            1)用户提示(输出以下语句): 
            甲: 砣一色（见砣子和牌） 
            乙: 万一色（见万子和牌）
            丙: 线一色（见线子和牌）
            丁: 将将符（见将和牌2、5、8）
            2)用户提示(输出以下语句):
            最后一张牌: 海底捞月,是否开牌 ? (y / n)
            3)接收用户输入一个值(y / n)
            4)根据输入值做出相应对策:
            如果输入的值不是y和n，提示用户: 腰包已空，麻将散工!!!
            如果输入的值为n,提示用户: 此局臭庄！！！
            如果输入的值为y,电脑随机一个数字:
            0-- - 二砣     1-- - 二万     2-- - 二线
            再根据随机数输出此局输赢: 一箭双雕: 砣一色 / 万一色 / 线一色(根据随机数显示三者中对应一个值) + 将将符!!!*/
            //代码注释:
            //游戏提示: 甲:砣一色（见砣子和牌）
            Random RD = new Random();//随机数
            Console.WriteLine("砣一色（见砣子和牌）");
            //游戏提示: 乙:万一色（见万子和牌）
            Console.WriteLine("万一色（见万子和牌）");
            //游戏提示: 丙:线一色（见线子和牌）
            Console.WriteLine("线一色（见线子和牌）");
            //游戏提示: 丁:将将符（见将和牌2、5、8）
            Console.WriteLine("将将符（见将和牌2、5、8）");
            //游戏提示: 最后一张牌:海底捞月,是否开牌?(y/n)
            Console.WriteLine("最后一张牌:海底捞月,是否开牌?(y/n)");
            //接收输入值
            char YN = char.Parse(Console.ReadLine());
            if ((YN != 'Y' && YN != 'y') && (YN != 'N' && YN != 'n'))//如果输入值不等于y和n输出腰包已空，麻将散工!!!
            {
                Console.WriteLine("腰包已空，麻将散工!!!");
            }
            else if (YN == 'N' || YN == 'n')//如果输入值为n输出此局臭庄!!!
            {
                Console.WriteLine("此局臭庄!!!");
            }
            else //如果输入值为y
            {
                //得到随机数用来表示当前摸的牌
                int pai = RD.Next(0, 3);
                //如果pai的值为0代表二砣，输出一句话:砣一色+将将符!!!
                if (pai == 0)
                {
                    Console.WriteLine("砣一色+将将符!!!");
                }
                else if (pai == 1)//如果pai的值为1代表二万，输出一句话:万一色+将将符!!!
                {
                    Console.WriteLine("万一色+将将符!!!");
                }
                else//如果pai的值为2代表二线，输出一句话:线万一色+将将符!!!
                {
                    Console.WriteLine("线万一色+将将符!!!");
                }
            }
        }
    }
}
